# Завдання 1. Оптимізація виробництва
#
# Компанія виробляє два види напоїв: "Лимонад" і "Фруктовий сік". Для виробництва цих напоїв використовуються різні
# інгредієнти та обмежена кількість обладнання. Задача полягає у максимізації виробництва, враховуючи обмежені ресурси.
#
# Умови завдання:
# "Лимонад" виготовляється з "Води", "Цукру" та "Лимонного соку".
# "Фруктовий сік" виготовляється з "Фруктового пюре" та "Води".

# Обмеження ресурсів:
# 100 од. "Води"
# 50 од. "Цукру"
# 30 од. "Лимонного соку"
# 40 од. "Фруктового пюре".

# Виробництво одиниці "Лимонаду" вимагає 2 од. "Води", 1 од. "Цукру" та 1 од. "Лимонного соку".
# Виробництво одиниці "Фруктового соку" вимагає 2 од. "Фруктового пюре" та 1 од. "Води".

# Використовуючи PuLP, створіть модель,
# яка визначає, скільки "Лимонаду" та "Фруктового соку" потрібно виробити для максимізації загальної кількості
# продуктів, дотримуючись обмежень на ресурси. Напишіть програму, код якої максимізує загальну кількість вироблених
# продуктів "Лимонад" та "Фруктовий сік", враховуючи обмеження на кількість ресурсів.

# Результат:
# Total Production: 50.0
# Lemonade Production: 30.0
# Fruit Juice Production: 20.0

# Використання:
# 30 лмнд = 30 * (1 цукор + 2вода + 1 лим.сік) = 30 цукор + 60 вода + 30 лим.сік
# 20 фр.сік = 20 * (2 фр.пюре + 1вода) = 40 фр.пюре + 20 вода

# Залишки:
# "Води" 100 - (60 + 20) = 20
# "Цукру" 50 - 30 = 20
# "Лимонного соку" 30 - 30 = 0
# "Фруктового пюре" 40 - 40 = 0


def main():
    from pulp import LpProblem, LpMaximize, LpVariable

    # Створюємо проблему максимізації
    problem = LpProblem("Maximize_Production", LpMaximize)

    # Оголошуємо змінні рішення - кількість вироблених "Лимонадів" та "Фруктових соків"
    x1 = LpVariable("Lemonade", lowBound=0, cat='Integer')  # Кількість "Лимонаду"
    x2 = LpVariable("FruitJuice", lowBound=0, cat='Integer')  # Кількість "Фруктового соку"

    # Функція максимізації (кількість вироблених продуктів)
    problem += x1 + x2, "TotalProduction"

    # Обмеження ресурсів
    problem += 2 * x1 + x2 <= 100, "WaterConstraint"
    problem += x1 <= 50, "SugarConstraint"
    problem += x1 <= 30, "LemonJuiceConstraint"
    problem += 2 * x2 <= 40, "FruitPureeConstraint"

    # Розв'язання задачі
    problem.solve()

    # Вивід результатів
    print("Status:", problem.status)
    print("Total Production:", x1.varValue + x2.varValue)
    print("Lemonade Production:", x1.varValue)
    print("Fruit Juice Production:", x2.varValue)


if __name__ == "__main__":
    main()
